ChenV <- function(x) {
  # -------------------------------------------------------------------------
  # MATLAB кодирование: Linas Stripinis
  # Название:
  #   ChenV.R
  #
  # Ссылки:
  #  - Момин Джамил и Син-Ши Ян, Обзор литературы по бенчмарк-функциям для
  #    глобальных задач оптимизации, Int. Journal of Mathematical Modelling and
  #    Numerical Optimisation, том 4, № 2, с. 150–194 (2013).
  #    DOI: 10.1504/IJMMNO.2013.055204
  #
  # Глобально оптимальное решение:
  #   f = -2000.00399998400052936631
  #   x = c(0.50000000000358113539, -0.50000000000551381163)
  #
  # Предопределенные границы переменных:
  #   -500 <= x[i] <= 500, i = 1,...,n
  #   
  # Свойства задачи:
  #   n  = 2;
  #   #g = 0;
  #   #h = 0;
  #
  # Известные характеристики тестовой функции:
  #   Дифференцируемая, Не-сепарабельная, Не-масштабируемая, Многомодальная,
  #   Не-выпуклая, Не-плато, Не-нулевое-решение, Симметричная
  # -------------------------------------------------------------------------
  if (missing(x)) {
    return(list(nx = 2,
                ng = 0,
                nh = 0,
                xl = function(nx) get_xl(nx),
                xu = function(nx) get_xu(nx),
                fmin = function(nx) get_fmin(nx),
                xmin = function(nx) get_xmin(nx),
                features = c(1, 0, 0, 1, 0, 0, 0, 1),
                libraries = c(0, 0, 0, 0, 1, 0, 0, 0, 0, 0)))
  }
  

  
  y <- -(0.001 / (0.001^2 + (x[1]^2 + x[2]^2 - 1)^2)) -
    (0.001 / (0.001^2 + (x[1]^2 + x[2]^2 - 0.5)^2)) -
    (0.001 / (0.001^2 + (x[1]^2 - x[2]^2)^2))
  return(y)
}

get_xl <- function(nx) {
  return(rep(-500, nx))
}

get_xu <- function(nx) {
  return(rep(500, nx))
}

get_fmin <- function(nx) {
  return(-2000.00399998400052936631)
}

get_xmin <- function(nx) {
  return(c(0.50000000000358113539, -0.50000000000551381163))
}
