Cola <- function(x) {
  # -------------------------------------------------------------------------
  # MATLAB кодирование: Linas Stripinis
  # Название:
  #   Cola.R
  #
  # Ссылки:
  #  - Гавана, А.: Глобальные бенчмарки и ампго. 
  #    URL: http://infinity77.net/global_optimization/index.html	
  #  - Момин Джамил и Син-Ши Ян, Обзор литературы по бенчмарк-функциям для
  #    глобальных задач оптимизации, Int. Journal of Mathematical Modelling and
  #    Numerical Optimisation, том 4, № 2, с. 150–194 (2013).
  #    DOI: 10.1504/IJMMNO.2013.055204
  #
  # Глобально оптимальное решение:
  #   f = 12.01502083800263243063
  #   x = [-0.00000000000000000053;  0.56148318393624918610; -1.52448151658903530148;
  #         2.43203630380497592967;  1.94210728841194524286;  3.99999999998045607796;
  #        -0.30688915161225388539;  2.38359515479439254548; -1.27124852757517281532;
  #         3.57147102339169464358;  0.21853259400328020612;  3.18583011193942367001;
  #        -1.77606975239290876267;  1.55385750601535166382;  1.13503453649639163281;
  #        -0.00000000000000000053; -0.00000000000000000053]
  #
  # Предопределенные границы переменных:
  #   -4 <= x[i] <= 4, i = 1,...,n
  #   
  # Свойства задачи:
  #   n  = 17;
  #   #g = 0;
  #   #h = 0;
  #
  # Известные характеристики тестовой функции:
  #   Дифференцируемая, Не-сепарабельная, Не-масштабируемая, Многомодальная,
  #   Не-выпуклая, Не-плато, Нулевое-решение, Асимметричная
  # -------------------------------------------------------------------------
  if (missing(x)) {
    return(list(nx = 17,
                ng = 0,
                nh = 0,
                xl = function(nx) get_xl(nx),
                xu = function(nx) get_xu(nx),
                fmin = function(nx) get_fmin(nx),
                xmin = function(nx) get_xmin(nx),
                features = c(1, 0, 0, 1, 0, 0, 1, 0),
                libraries = c(0, 0, 0, 1, 1, 0, 0, 0, 0, 0)))
  }
  

  
  d <- matrix(c(1.27, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00,
                1.69, 1.43, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00,
                2.04, 2.35, 2.43, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00,
                3.09, 3.18, 3.26, 2.85, 0.00, 0.00, 0.00, 0.00, 0.00,
                3.20, 3.22, 3.27, 2.88, 1.55, 0.00, 0.00, 0.00, 0.00,
                2.86, 2.56, 2.58, 2.59, 3.12, 3.06, 0.00, 0.00, 0.00,
                3.17, 3.18, 3.18, 3.12, 1.31, 1.64, 3.00, 0.00, 0.00,
                3.21, 3.18, 3.18, 3.17, 1.70, 1.36, 2.95, 1.32, 0.00,
                2.38, 2.31, 2.42, 1.94, 2.85, 2.81, 2.56, 2.91, 2.97), nrow = 9)
  y <- 0
  df <- rep(0, 9)
  z <- rep(0, 9)
  df[2] <- x[2]
  for (i in 3:9) {
    df[i] <- x[2*(i - 2)]
    z[i] <- x[2*(i - 2) + 1]
  }
  
  for (i in 1:9) {
    for (j in 1:9) {
      if (i > j) {
        r <- sqrt((df[i] - df[j])^2 + (z[i] - z[j])^2)
        y <- y + (r - d[i, j])^2
      }
    }
  }
  
  return(y)
}

get_xl <- function(nx) {
  return(rep(-4, nx))
}

get_xu <- function(nx) {
  return(rep(4, nx))
}

get_fmin <- function(nx) {
  return(12.01502083800263243063)
}

get_xmin <- function(nx) {
  return(c(-0.00000000000000000053,  0.56148318393624918610, -1.52448151658903530148,
           2.43203630380497592967,  1.94210728841194524286,  3.99999999998045607796,
           -0.30688915161225388539,  2.38359515479439254548, -1.27124852757517281532,
           3.57147102339169464358,  0.21853259400328020612,  3.18583011193942367001,
           -1.77606975239290876267,  1.55385750601535166382,  1.13503453649639163281,
           -0.00000000000000000053, -0.00000000000000000053))
}
