# Определение функции Deceptive
# Параметры:
#   x: Входной вектор
# Возвращает:
#   Значение функции Deceptive в заданной точке
Deceptive <- function(x) {
  # Проверка на отсутствие входных данных (для получения свойств функции)
  if (missing(x)) {
    return(list(nx = 0,  # Количество измерений
                ng = 0,  # Количество неравенств
                nh = 0,  # Количество равенств
                xl = function(nx) get_xl(nx),  # Нижние границы
                xu = function(nx) get_xu(nx),  # Верхние границы
                fmin = function(nx) get_fmin(nx),  # Глобальный минимум
                xmin = function(nx) get_xmin(nx),  # Точка глобального минимума
                features = c(0, 0, 1, 1, 0, 0, 0, 1),  # Характеристики функции
                libraries = c(0, 0, 0, 1, 0, 0, 0, 0, 0, 0)))  # Связанные библиотеки
  }
  
  # Приведение значений x к интервалу [0, 1]
  x <- pmax(0, pmin(1, x))
  
  # Вычисление значения функции Deceptive
  b <- 2
  a <- 1
  y <- 0
  for (i in 1:length(x)) {
    if (x[i] >= 0 && x[i] <= 4/5 * a) {
      g <- -x[i] / a + 4/5
    } else if (x[i] > 4/5 * a && x[i] <= a) {
      g <- (5 * x[i]) / a - 4
    } else if (x[i] > a && x[i] <= (1 + 4 * a) / 5) {
      g <- (5 * (x[i] - a)) / (a - 1) + 1
    } else if (x[i] > (1 + 4 * a) / 5 && x[i] <= 1) {
      g <- (x[i] - 1) / (1 - a) + 4/5
    }
    y <- y + g
  }
  y <- -((y / length(x)) ^ b)
  
  return(y)
}

# Определение функции для получения нижних границ
get_xl <- function(nx) {
  return(rep(0, nx))
}

# Определение функции для получения верхних границ
get_xu <- function(nx) {
  return(rep(1, nx))
}

# Определение функции для получения глобального минимума
get_fmin <- function(nx) {
  return(-1)
}

# Определение функции для получения точки глобального минимума
get_xmin <- function(nx) {
  return(rep(1, nx))
}
